var data = [
    [
        ["القاهرة"],
        [
            ["ماهي عاصمة مصر"],
			["تبدأ بحرف ال ق"],
            
        ],
    ],
    [
        ["5"],
        [
            ["ماهي عدد أركان الإسلام"],
			["عد أصابعك"],

        ],
    ],
	[
        ["ويندوز"],
        [
            ["ماهو نظام تشغيل مايكروسفت"],
			["شباك بالإنجليزية"],

        ],
    ],
	[
        ["الصلاة"],
        [
            ["من أركان الإسلام"],
			["عماد الدين"],

        ],
    ],
	[
        ["القلم"],
        [
            ["ماهو الشيء الذي يكتب ولا يقرأ ؟"],
			["نستعمله في المدرسة"],

        ],
    ],
	[
        ["الشاي"],
        [
            ["ماهو الشيء الذي يكون اخضر في الارض واسود في السوق واحمر في البيت ؟"],
			["مشروب"],

        ],
    ],
	[
        ["العمر"],
        [
            ["ماهو الشيء الذي كلما زاد نقص ؟"],
			["تسأل عنه أحيانا"],

        ],
    ],
	[
        ["المسمار"],
        [
            ["ما هو الشيء الذي لا يمشي إلا بالضرب ؟"],
			["نجار"],

        ],
    ],
	[
        ["الإبرة"],
        [
            ["لها عين ولا رأس لها، ما هي؟"],
			["خيط"],

        ],
    ],
	
	[
        ["الحفرة"],
        [
            ["ما هو الشيء الذي إذا أخذنا منه إزداد وكبر ؟"],
			["وقع فيها"],

        ],
    ],
	[
        ["المشط"],
        [
            ["له أسنان ولا يعض، ما هو ؟"],
			["خيط"],

        ],
    ],
	[
        ["7"],
        [
            ["عائلة مؤلفة من 6 بنات وأخ لكل منهن، فكم عدد أفراد العائلة ؟"],
			["إخوة"],

        ],
    ],
	[
        ["الهواء"],
        [
            ["يتحرك دائماً حواليك لكنك لاتراه فما هو ؟"],
			["في كل مكان"],

        ],
    ],
	[
        ["القاف"],
        [
            ["ما هو الشىء الذى يوجد في القرن مرة و في الدقيقة مرتين ولا يوجد في الساعة ؟"],
			["قف"],

        ],
    ],
	[
        ["الهاتف"],
        [
            ["يسمع بلا أذن ويتكلم بلا لسان فما هو ؟"],
			["مكالمة"],

        ],
    ],
	[
        ["بيت الشعر"],
        [
            ["ما هو البيت الذي ليس فيه ابواب ولا نوافذ ؟"],
			["نزار قباني"],

        ],
    ],
	[
        ["البيض"],
        [
            ["ما هو الشيء الذي إذا غليته جمد ؟"],
			["بروتينات"],

        ],
    ],
	[
        ["أبي"],
        [
            ["عمتك اخت ابوك خال ابنها من هو ؟"],
			["أخ عمي وليس عمي"],

        ],
    ],
	[
        ["البحر"],
        [
            ["ما هو الشئ الذي يرفع اثقال ولا يقدر يرفع مسمار ؟"],
			["الصيف"],

        ],
    ],
	[
        ["أنا"],
        [
            ["ابن أمك و ابن أبيك، و ليس بأختك و لا بأخيك فمن يكون ؟"],
			["فرضا ما عنده إخوة"],

        ],
    ],
	[
        ["شجرة العائلة"],
        [
            ["ما هي الشجرة التي ليس لها ظل وليس لها ثمار ؟"],
			["أصول"],

        ],
    ],
	[
        ["الثلج"],
        [
            ["أنا ابن الماء فإن تركوني في الماء مت فمن أنا ؟"],
			["مشروبات"],

        ],
    ],
	[
        ["الطاولة"],
        [
            ["إننا أربعة إخوة لنا رأس واحد فمن نحن ؟"],
			["غداء"],

        ],
    ],
	[
        ["والدي"],
        [
            ["من هو الخال الوحيد لأولاد عمتك ؟"],
			["من العائلة"],

        ],
    ],
	[
        ["الساعة"],
        [
            ["ما هو الشيء الذي يمشي و يقف وليس له أرجـل ؟"],
			["كالسيف"],

        ],
    ],
	[
        ["أمي"],
        [
            ["أخت خالك وليست خالتك من تكون ؟"],
			["الحنان"],

        ],
    ],
	[
        ["البيضة"],
        [
            ["ما هو الشيء الذي اسمه على لونه ؟"],
			["دواجن"],

        ],
    ],
	[
        ["الإسفنجة"],
        [
            ["كلي ثقوب ومع ذلك أحفظ الماء فمن أكون ؟"],
			["مسح"],

        ],
    ],
	[
        ["الكتاب"],
        [
            ["له أوراق وما هو بنبات، له جلد وما هو بحيوان، وعلم وما هو بإنسان. من هو ؟"],
			["مدرسة"],

        ],
    ],
	[
        ["الجوع"],
        [
            ["ما هو الشيء الذي يقرصك ولا تراه ؟"],
			["كافر"],

        ],
    ],
	[
        ["4"],
        [
            ["رقم إذا ضرب فى الرقم الذي يليه كان حاصل الضرب يساوي ناتج جمعهما + 11 ؟"],
			["عدد زوجي"],

        ],
    ],
	[
        ["5"],
        [
            ["رقم إذا ضرب فى الرقم الذي يليه كان حاصل الضرب يساوي ناتج جمعهما + 19 ؟"],
			["عدد فردي"],

        ],
    ],
	[
        ["الصوت"],
        [
            ["اسير بلا رجلين ولا ادخل إلا بالاذنين فمن انا ؟"],
			["غناء"],

        ],
    ],
	[
        ["الساعة"],
        [
            ["ماهو الشيء الذي لا يتكلم وإذا أكل صدق وإذا جاع كذب ؟"],
			["بطارية"],

        ],
    ],
	[
        ["الدائرة"],
        [
            ["ما هو الشيء الذى ليس له بداية ولا نهاية ؟"],
			["شكل"],

        ],
    ],
	[
        ["الجرس"],
        [
            ["ماهو الشيء الذى إذا لمسته صاح ؟"],
			["مدرسة"],

        ],
    ],
	[
        ["سفينة"],
        [
            ["حامل و محمول نصف ناشف و نصف مبلول فمن أكون ؟"],
			["أسماك"],

        ],
    ],
	[
        ["المرآة"],
        [
            ["ارى كل شيء من دون عيون فمن أكون ؟"],
			["بيضاء الثلج"],

        ],
    ],
	[
        ["أبجدية"],
        [
            ["كلمة تتكون من 8 حروف ولكنها تجمع كل الحروف"],
			["ترتيب"],

        ],
    ],
	[
        ["دم"],
        [
            ["قطعنا خرطوم الفيل ماذا يطلع"],
			["أحمر"],

        ],
    ],
	[
        ["فطور"],
        [
            ["ما هو الشي الذي لا يؤكل في الليل ابدا ؟"],
			["صباح"],

        ],
    ],
	[
        ["الكل"],
        [
            ["ما هي المدينة التي لا يطحن فيها الطحين ولا يموت فيها ميت"],
			["طحن الطحين؟"],

        ],
    ],
	[
        ["اللام"],
        [
            ["ما هو الشيء الذي تراه في الليل 3 مرات وفي النهار مرة واحدة ؟"],
			["آخر السلام"],

        ],
    ],
	[
        ["إسمك"],
        [
            ["ما هو الشيء الذي لك ويستخدمه الناس من دون اذنك"],
			["مناداة"],

        ],
    ],
	[
        ["مجمد"],
        [
            ["متى تستطيع وضع الماء في الغربال ؟"],
			["تبريد"],

        ],
    ],
	[
        ["سعيد"],
        [
            ["اذا كان سعيد على يمين سمير وجابر على يمين سعيد فمن يكون في الوسط ؟"],
			["كم عددهم"],

        ],
    ],
	[
        ["خلية نحل"],
        [
            ["يتسع لمئات الألوف ولا يتسع للطير ؟"],
			["شفاء"],

        ],
    ],
	[
        ["بنك الدم"],
        [
            ["ما هو البنك الذي لا يتعامل بالمال؟"],
			["جراحة"],

        ],
    ],
	[
        ["نجم"],
        [
            ["شيء موجود في السماء إذا أضفت إليه حرفا أصبح في الأرض؟"],
			["كذب ولو صدق"],

        ],
    ],
	[
        ["الإبرة"],
        [
            ["ما هو الشي الذي يكسو الناس و هو عار بدون ملابس ؟"],
			["خياطة"],

        ],
    ],
	[
        ["حرف السين"],
        [
            ["شي في السماء و ليس في الماء , فما هو ؟"],
			["إختلاف"],

        ],
    ],
	[
        ["الباب المفتوح"],
        [
            ["ما هو الباب الذي لا يمكن فتحه ؟ "],
			["لماذا لا يفتح"],

        ],
    ],
	[
        ["تموز"],
        [
            ["ما هو إسم الشهر الميلادي الذي إذا حذفت أوله , تحول إلى إسم فاكهه ؟"],
			["فاكهة صفراء"],

        ],
    ],
	[
        ["الصمت"],
        [
            ["ما هي الكلمه التي يبطل معناها إذا نطقنا بها ؟"],
			["حكمة"],

        ],
    ],
	[
        ["الحنفية"],
        [
            ["من أين يشرب سكان وادي النيل ؟"],
			["مثل بقية البشر"],

        ],
    ],
	[
        ["حرف الواو"],
        [
            ["ما الذي يكون بين السماء و الارض ؟"],
			["أعد قراءة السؤال"],

        ],
    ],
	[
        ["البصل"],
        [
            ["ما هو الشي الذي تذبحه و تبكي عليه ؟"],
			["ليس حيوان"],

        ],
    ],
	[
        ["الضوء"],
        [
            ["ما هو الشي الذي يخترق الزجاج ولا يكسره ؟"],
			["النهار"],

        ],
    ],
	[
        ["الصدى"],
        [
            ["ما هو الشي الذي يتكلم جميع لغات العالم ؟"],
			["مكان شاسع أو عال"],

        ],
    ],
	[
        ["الماء"],
        [
            ["ما هو أهون موجود و أعز مفقود ؟"],
			["ضروري للجسم"],

        ],
    ],
	[
        ["الشمعة"],
        [
            ["ما هي التي تحرق نفسها لتفيد غيرها ؟"],
			["ضلام"],

        ],
    ],
	[
        ["الحصان"],
        [
            ["من هو الذي ينام مرتديا حذاءه لا يفارقه ؟"],
			["العربي أشهرهم"],

        ],
    ],
	[
        ["خريطة"],
        [
            ["أين يكون النهر بلا ماء ؟"],
			["جغرافيا"],

        ],
    ],
	[
        ["السكر"],
        [
            ["ما هو الذي إذا دخل الماء ضاع و تشتت و ليس الثلج ؟"],
			["حلوى"],

        ],
    ],
	[
        ["القفص الصدري"],
        [
            ["ما هو القفص الذي لا يحبس فيه حيوان أو طير ؟"],
			["إنسان؟"],

        ],
    ],
	[
        ["الزجاجة"],
        [
            ["لها رقبه و ليس لها رأس .. فماهي ؟"],
			["سائل"],

        ],
    ],
	[
        ["السلحفاة"],
        [
            ["ما هو الذي لحمه من الداخل و عظمه من الخارج ؟"],
			["بطئ"],

        ],
    ],
	[
        ["اللسان"],
        [
            ["ما هو الشي الذي يعتبر غير نظيف اذا ابيض لونه ؟"],
			["إذا خنته خانك"],

        ],
    ],
	[
        ["الرصاصة"],
        [
            ["ما هو الشي الذي تسمعه و لا تراه و إذا رأيته لا تسمعه ؟"],
			["حرب"],

        ],
    ],
	[
        ["العلا"],
        [
            ["مدينه سعوديه تقرأ طرديا و عكسيا .. فما هي ؟"],
			["حرف وحيد في المنتصف"],

        ],
    ],
	[
        ["الخفاش"],
        [
            ["ما هو الطائر الذي يرى بإذنيه ؟"],
			["باطمان"],

        ],
    ],
	[
        ["الخبز"],
        [
            ["ما هو الشي الذي يدخل مبلولا و يخرج ناشفا ؟"],
			["يأكل"],

        ],
    ],
	[
        ["النصف"],
        [
            ["الشيء الذي يشبه نصف وجه القمر .. فما هو ؟"],
			["النصف؟"],

        ],
    ],
	[
        ["الإنسان"],
        [
            ["ما هو الشي الذي في رأسه سبع فتحات؟"],
			["أنت"],

        ],
    ],
	[
        ["أختي"],
        [
            ["من هي بنت خال بنت والدك ؟ "],
			["قريبتي"],

        ],
    ],
	[
        ["الضوء"],
        [
            ["إذا دخل الماء لم يبتل ؟"],
			["مصباح"],

        ],
    ],
	[
        ["البيض"],
        [
            ["ما هو الشي الذي لا يستفاد منه إلا إذا كسر ؟"],
			["بروتينات"],

        ],
    ],
	[
        ["الأرض"],
        [
            ["ما لذي يوقف سقوط الشعر ؟"],
			["كوكب"],

        ],
    ],
	[
        ["الزاوية"],
        [
            ["أين يلتقي الجدار بالجدار"],
			["رياضيات"],

        ],
    ],
	[
        ["الحائط"],
        [
            ["ما هو الذي يلف حول الغرفه دون أن يتحرك ؟"],
			["عمودي"],

        ],
    ],
	[
        ["اللسان"],
        [
            ["ما هي حاسة الشم عند الثعبان ؟"],
			["ليس كالإنسان"],

        ],
    ],
	[
        ["الميزان"],
        [
            ["مصنوع من الحديد والكل بحكمه راضي ؟"],
			["العدل"],

        ],
    ],
	[
        ["الحلاق"],
        [
            ["لمن ينحني الإمبراطور رأسه ؟"],
			["جمال"],

        ],
    ],
	[
        ["آدم"],
        [
            ["من هو الذي مات و لم يولد ؟"],
			["الجنة"],

        ],
    ],
	[
        ["الذكر"],
        [
            ["ما هو الحيوان الذي لا يلد ولا يبيض ؟"],
			["من الذي يلد أو يبيض"],

        ],
    ],
	[
        ["المذياع"],
        [
            ["بحركه من إصبعك يحدثك بكل لسان .. فما هو ؟"],
			["جهاز"],

        ],
    ],
	[
        ["الذيل"],
        [
            ["ما هو الذي خلف الكلب أينما ذهب ؟"],
			["دائما في الخلف"],

        ],
    ],
	[
        ["النقاط"],
        [
            ["في الشتاء خمس .. و في الصيف ثلاث .. فما هي ؟"],
			["."],

        ],
    ],
	[
        ["الكرة"],
        [
            ["تضرب بلا سبب .. و تطير بلا جناح .. و تسبب الفرح و الغضب .. فما هي ؟"],
			["رونالدو"],

        ],
    ],
	[
        ["حرف الراء "],
        [
            ["يوجد في استراليا و امريكا و اوروبا و لا يوجد في آسيا .. فما هو؟"],
			["ركز في الكلمات"],

        ],
    ],
	[
        ["الكفيف"],
        [
            ["من هو الذي تراه ولا يراك ؟"],
			["حواس"],

        ],
    ],
	[
        ["الظلام"],
        [
            ["ما هو الشي الذي تراه في الظلام في كل مكان ؟"],
			["ماذا ترى في الظلام؟"],

        ],
    ],
	[
        ["المنتحر"],
        [
            ["من هو القاتل الذي لا يستطيع أن يقاتله احد من المخلوقات ؟"],
			["هو إنسان"],

        ],
    ],
	[
        ["صورة"],
        [
            ["رأي أحد الشباب النجوم في الظهر .. كيف حدث ذلك ؟"],
			["فن"],

        ],
    ],
	[
        ["لا يلد"],
        [
            ["هل الجمل يلد في الشهر التاسع أم العاشر ؟"],
			["الجمل؟"],

        ],
    ],
	[
        ["جامعة الدول العربية"],
        [
            ["ما هي الجامعه الخاليه من الطلاب ؟"],
			["عربية"],

        ],
    ],
	[
        ["رماد"],
        [
            ["ما هو الشي الذي ينام ولا يقوم ؟"],
			["بعد حريق"],

        ],
    ],
	[
        ["الدخان"],
        [
            ["ما هو الشي الذي يذهب ولا يرجع ؟"],
			["مضر للصحة"],

        ],
    ],
	[
        ["شفاف"],
        [
            ["ما هو لون الماء في النيل الأزرق ؟"],
			["لون الماء"],

        ],
    ],
	[
        ["الطاحونة"],
        [
            ["تدور و لا تتعب .. و تأكل و لا تشرب .. فما هي ؟"],
			["دقيق"],

        ],
    ],
	[
        ["بحر الشعر"],
        [
            ["ما هو البحر الذي لا يغرق فيه أحد ؟"],
			["أبو قاسم الشابي"],

        ],
    ],
	[
        ["نبات"],
        [
            ["ما هو الشي الذي ليس بإنسان ولا حيوان و لا جماد ؟"],
			["أخضر"],

        ],
    ],
	[
        ["حرف الياء "],
        [
            ["ما هو الشي الذي لا يخلو منه أي بيت ؟"],
			["وسط البيت"],

        ],
    ],
	[
        ["الصورة"],
        [
            ["ما هو الشي الذي يؤخذ منك قبل أن يعطي لك ؟"],
			["سيلفي"],

        ],
    ],
	[
        ["الفلفل"],
        [
            ["ما هو الشي الذي درجة حرارته ثابته سواء وضعته في الثلاجه او على النار ؟"],
			["حرارة"],

        ],
    ],
	[
        ["الباذنجان"],
        [
            ["جسم اسود و قلب ابيض و رأس أخضر .. فما هو ؟"],
			["مطبخ"],

        ],
    ],
	[
        ["إبرة"],
        [
            ["ما هو الشي الذي كلما خطا خطوه فقد شيئا من ذيله ؟"],
			["ملابس"],

        ],
    ],
	[
        ["السحابة"],
        [
            ["ما هي التي تمشي بلا رجلين و تبكي بلا عينين ؟"],
			["غيوم"],

        ],
    ],
	[
        ["نملة سليمان"],
        [
            ["من هو الذي أنذر قومه و ليس من الجن و لا من الإنس ؟"],
			["صغير الحجم"],

        ],
    ],
	[
        ["حرف الراء"],
        [
            ["ما هو الشي الذي وسط باريس ؟"],
			["ركز عن الكلمة"],

        ],
    ],
	[
        ["حرف الألف"],
        [
            ["ما هو آخر الدنيا ؟"],
			["الله أعلم به"],

        ],
    ],
	[
        ["بجع"],
        [
            ["ما هو اسم الطائر الذي اذا قلبته ترى عجب ؟"],
			["جمال"],

        ],
    ],
	[
        ["شمعة"],
        [
            ["ما هو الشي الذي قلبه يأكل قشره ؟"],
			["ضوء"],

        ],
    ],
	[
        ["السمك"],
        [
            ["ماهو الميت الذي يجوز أكله دون إثم؟"],
			["سباحة"],

        ],
    ],
	[
        ["القط"],
        [
            ["من هو الذي يغسل وجهه ولا يمشط شعره ؟"],
			["توم و جيري"],

        ],
    ],
	[
        ["الضابط"],
        [
            ["رجلاه على الارض و رأسه فوق النجوم .. فما هو ؟"],
			["أمن"],

        ],
    ],
	[
        ["الظل"],
        [
            ["ما هو الشي الذي إذا أصببت عليه الماء .. لا يبتل ؟"],
			["يرى في الضوء"],

        ],
    ],
	[
        ["كم الساعة"],
        [
            ["ما هو السؤال الذي تختلف إجابته دائما ؟"],
			["سؤال مهم"],

        ],
    ],
	[
        ["5"],
        [
            ["سار عدد من الأولاد في صف فكانوا أربعة أمام ولد وأربعة خلف ولد وولد في الوسط فكم كان عدد الأولاد"],
			["صف"],

        ],
    ],
	[
        ["كل الشهور"],
        [
            ["كم شهر في السنة الميلادية يحتوي على 28 يوم"],
			["28 يوم"],

        ],
    ],
	[
        ["2520"],
        [
            ["ماهو العدد الذي له عشر و تسع و ثمن و سبع و سدس و خمس و ربع و ثلث و نصف"],
			["إستعمل قواعد القسمة"],

        ],
    ],
	[
        ["2"],
        [
            ["امك و مرات ابوك و اخت خالك و ام اخوك كم اذن لهم"],
			["ماهي القرابة بينهم"],

        ],
    ],
	[
        ["الثلاثاء"],
        [
            ["ثلاثة مع ثلاثة وكل ما عديت سبعة صار السبعة ثلاثة"],
			["إلى ما يرمز عدد 7"],

        ],
    ],
	[
        ["عجلات الدراجة"],
        [
            ["شقيقتان تجري إحداهما وراء الأخرى دون اللحاق بها؟"],
			["سياقة"],

        ],
    ],
	[
        ["صابورة"],
        [
            ["أذا أبيضت إتسخت؟"],
			["مدرسة"],

        ],
    ],
	[
        ["أبي"],
        [
            ["خال أبن عمتك؟"],
			["بالنسبة لي"],

        ],
    ],
	[
        ["الملح"],
        [
            ["ماهو الشيء الذي يخرج من الماء ويموت في الماء ؟"],
			["يستعمل في الطعام"],

        ],
    ],
	[
        ["المقص"],
        [
            ["ماهو الشيء الذي لايمكن الإنتفاع به إلا إذا وضعت أصبعك في عينه؟"],
			["حصة الرسم"],

        ],
    ],
	[
        ["القمح"],
        [
            ["ماهو الشيء الذي رأسه للإنسان وكعبه للحيوان؟"],
			["دقيق"],

        ],
    ],
	[
        ["الديك"],
        [
            ["له تاج وليس بملك ويدلك على الوقت؟"],
			["في الصباح"],

        ],
    ],
	[
        ["الإمام"],
        [
            ["رجل إذا أعطاك قفاه حكمك وإذا أعطاك وجهه انتهى حكمه ؟"],
			["عماد الدين"],

        ],
    ],
	[
        ["الفحم"],
        [
            ["لونه أسود ولاينتفع به إلا إذا كان لونه أحمر ؟"],
			["تتسخ اليد بلمسه"],

        ],
    ],
	[
        ["حرف اللام"],
        [
            ["ما الشي الذي أوله في لبنان وآخره في إسطمبول ؟"],
			["أول و آخر"],

        ],
    ],
	[
        ["القلم"],
        [
            ["أعمى وأطرش وأخرس ويسير على رأسه ؟"],
			["كاتب"],

        ],
    ],
	[
        ["على الخريطة"],
        [
            ["أين توجد بلاد بلا سكان وأنهار بلا مياه وأرض بلا تراب؟"],
			["جغرافيا"],

        ],
    ],
	[
        ["عقارب الساعة"],
        [
            ["أخوان لايستطيعان تمضية أكثر من دقيقة معاً ؟"],
			["على الحائط أو في اليد"],

        ],
    ],
	[
        ["حرف الياء"],
        [
            ["تجده في الثانية والدقيقة واليوم؟"],
			["ركز عن الكلمة"],

        ],
    ],
	[
        ["القفاز"],
        [
            ["له خمس أصابع بلا عظم ولا لحم ؟"],
			["عديد الإستعال"],

        ],
    ],
	[
        ["القمر"],
        [
            ["له وجه وليس له لسان ، يدل الناس على الزمان ماهو ؟"],
			["الليل"],

        ],
    ],
	[
        ["اليوم"],
        [
            ["لم أكن موجوداً بالأمس وولدت اليوم وغداً أموت ؟"],
			["تاريخ"],

        ],
    ],
	[
        ["الظل"],
        [
            ["لم أكشيء يكون كبيراً عند الشروق وصغيراً عند الظهيرة وكبيراً عند المساء؟"],
			["الضوء"],

        ],
    ],
	[
        ["الدموع"],
        [
            ["ماهو الماء الذي لم يخرج من الأرض ولم ينزل من السماء ؟"],
			["حزن  أو فرح"],

        ],
    ],
	[
        ["الطريق"],
        [
            ["ماهو الشيء الذي يحملك إلى حيث تريد وهو واقف؟"],
			["معبد"],

        ],
    ],
	[
        ["على الأرض"],
        [
            ["إذا كنت على حدود المكسيك وركلت الكرة أين تقع"],
			["عادة أين تقع"],

        ],
    ],
];